RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MK80F25615/fsl_sim_hal_MK80F25615.c
    switch (instance)
    {
    case 0:
        retValue = (sim_lpuart_rxsrc_t)SIM_BRD_SOPT5_LPUART0RXSRC(base);
        break;
    case 1:
        retValue = (sim_lpuart_rxsrc_t)SIM_BRD_SOPT5_LPUART1RXSRC(base);
        break;
    default:
        break;
    }
    
    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetLpuartTxSrcMode
 * Description   : Sets the LPUARTx transmit data source select setting.
 * This function  selects the source for the LPUARTx transmit data.
 *
 *END**************************************************************************/
void SIM_HAL_SetLpuartTxSrcMode(SIM_Type * base,
                                uint32_t instance,
                                sim_lpuart_txsrc_t select)
{
    assert(instance < LPUART_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT5_LPUART0TXSRC(base, select);
        break;
    case 1:
        SIM_BWR_SOPT5_LPUART1TXSRC(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetLpuartTxSrcMode
 * Description   :Gets the LPUARTx transmit data source select setting.
 * This function  gets the LPUARTx transmit data source select setting.
 *
 *END**************************************************************************/
sim_lpuart_txsrc_t SIM_HAL_GetLpuartTxSrcMode(SIM_Type * base,
                                              uint32_t instance)
{
    sim_lpuart_txsrc_t retValue = (sim_lpuart_txsrc_t)0;
    
    assert(instance < LPUART_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_lpuart_txsrc_t)SIM_BRD_SOPT5_LPUART0TXSRC(base);
        break;
    case 1:
        retValue = (sim_lpuart_txsrc_t)SIM_BRD_SOPT5_LPUART0TXSRC(base);
        break;
    default:
        break;
    }
    
    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmTriggerSrcMode
 * Description   : Set FlexTimer x hardware trigger y source select setting
 * This function will select the source of FTMx hardware trigger y.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmTriggerSrcMode(SIM_Type * base,
                                  uint32_t instance,
                                  uint8_t  trigger,
                                  sim_ftm_trg_src_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

    switch (instance)
    {
    case 0:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT4_FTM0TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM0TRG1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 3:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT4_FTM3TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM3TRG1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmTriggerSrcMode
 * Description   : Get FlexTimer x hardware trigger y source select setting
 * This function will get FlexTimer x hardware trigger y source select setting.
 *
 *END**************************************************************************/
sim_ftm_trg_src_t SIM_HAL_GetFtmTriggerSrcMode(SIM_Type * base,
                                               uint32_t instance,
                                               uint8_t trigger)
{
    sim_ftm_trg_src_t retValue = (sim_ftm_trg_src_t)0;

    assert (instance < FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

    switch (instance)
    {
    case 0:
        switch (trigger)
        {
        case 0:
            retValue = (sim_ftm_trg_src_t)SIM_BRD_SOPT4_FTM0TRG0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_trg_src_t)SIM_BRD_SOPT4_FTM0TRG1SRC(base);
            break;
        default:
            break;
        }
        break;
    case 3:
        switch (trigger)
        {
        case 0:
            retValue = (sim_ftm_trg_src_t)SIM_BRD_SOPT4_FTM3TRG0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_trg_src_t)SIM_BRD_SOPT4_FTM3TRG1SRC(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmExternalClkPinMode
 * Description   : Set FlexTimer x external clock pin select setting
 * This function will select the source of FTMx external clock pin select
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmExternalClkPinMode(SIM_Type * base,
                                      uint32_t instance,
                                      sim_ftm_clk_sel_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT4_FTM0CLKSEL(base, select);
        break;
    case 1:
        SIM_BWR_SOPT4_FTM1CLKSEL(base, select);
        break;
    case 2:
        SIM_BWR_SOPT4_FTM2CLKSEL(base, select);
        break;
    case 3:
        SIM_BWR_SOPT4_FTM3CLKSEL(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmExternalClkPinMode
 * Description   : Get FlexTimer x external clock pin select setting
 * This function will get FlexTimer x external clock pin select setting.
 *
 *END**************************************************************************/
sim_ftm_clk_sel_t SIM_HAL_GetFtmExternalClkPinMode(SIM_Type * base,
                                                   uint32_t instance)
{
    sim_ftm_clk_sel_t retValue = (sim_ftm_clk_sel_t)0;

    assert (instance < FTM_INSTANCE_COUNT);

